import React, { useState } from "react";
import {
  Modal,
  Backdrop,
  Fade,
  Box,
  Typography,
  Tabs,
  Tab,
  Table,
  TableBody,
  TableCell,
  TableContainer,
  TableHead,
  TableRow,
  Paper,
} from "@mui/material";

const style = {
  position: "absolute",
  top: "50%",
  left: "50%",
  transform: "translate(-50%, -50%)",
  // width: "80%",
  maxWidth: 850,
  bgcolor: "background.paper",
  boxShadow: 24,
  p: 4,
  borderRadius: 2,
};

export default function TransitionsModal({ open, handleClose }) {
  const [tabIndex, setTabIndex] = useState(0);

  const handleTabChange = (event, newValue) => {
    setTabIndex(newValue);
  };

  // const SquareColorBox = ({ color, children }) => {
  //   return (
  //     <div style={{ display: "flex", alignItems: "center" }}>
  //       <div
  //         style={{
  //           width: 20,
  //           height: 20,
  //           backgroundColor: color,
  //           marginRight: 8,
  //           borderRadius: 4,
  //         }}
  //       ></div>
  //       <div>{children}</div>{" "}
  //       {/* this will render the <strong>{row.level}</strong> */}
  //     </div>
  //   );
  // };

  // Data for tables

  const detail = [
    {
      impact: `โรคไข้เลือดออกเดงกี่เป็นโรคติดเชื้อไวรัสเดงกี
                ที่มียุงลายเป็นแมลงนำโรค โรคนี้ได้กลายเป็น
                ปัญหา สาธารณสุขในหลายประเทศทั่วโลก
                เนื่องจากโรคได้ แพร่กระจายอย่างกว้างขวาง
                และจำนวนผู้ป่วยเพิ่มขึ้นอย่างมากใน 30 ปีที่
                ผ่านมา มากกว่า 100 ประเทศที่โรคนี้กลายเป็น
                โรคประจำถิ่นและโรคนี้ยังคุกคามต่อสุขภาพของ
                ประชากรโลกมากกว่าร้อยละ 40 (2,500 ล้าน
                คน) โดยเฉพาะอย่างยิ่งจะพบมากในประเทศเขต
                ร้อน และเขตอบอุ่น ซึ่งร้อยละ 70 ของผู้ป่วย
                ทั้งหมดมาจากประเทศในภูมิภาคเอเชีย สำหรับ
                ประเทศไทยเริ่มมีรายงานพบผู้ป่วยโรคไข้เลือด
                ออกครั้งแรกในปี พ.ศ. 2492 และพบการระบาด
                ที่สุดในปีพ.ศ. 2530 มีรายงานผู้ป่วยสูงถึง
                170,000 กว่าราย เสียชีวิต 1,000 กว่าราย
                หลังจากนั้นประเทศไทยมีแนวโน้มของการพบผู้
                ป่วยโรคไข้เลือดออกเพิ่มขึ้นโดยในปีที่มีการ
                ระบาดใหญ่จะพบผู้ป่วยมากกว่า 100,000 ราย
                และเสียชีวิต 100 รายขึ้นไป โรคไข้เลือดออกมี
                ลักษณะที่แปรผันตามฤดูกาล (Seasonal
                variation) โดยจะเริ่มมีแนวโน้มผู้ป่วยสูงขึ้นใน
                เดือนเมษายนและสูงสุดในเดือนมิถุนายน -
                สิงหาคม ซึ่งเป็นฤดูฝน เดือนกันยายนจะเริ่มมี
                แนวโน้มผู้ป่วยลดลง แต่ถ้าหากช่วงปลายปี
                จำนวนผู้ป่วยไม่ลดลงและยังคงสูงลอยอาจ
                ทำให้เกิดการระบาดต่อเนื่องในปีถัดไปได้`,
    },
  ];

  const symptom = [
    {
      impact1: `1. Undifferntiate fever; UF หรือกลุ่มอาการ
                    ไวรัส มักพบในทารกหรือเด็กเล็ก มีเพียงอาการ
                    ไข้ 2 - 3 วัน อาจมีผื่นแบบ Muculopapular
                    rash มีอาการคล้ายกับโรคติดเชื้อไวรัสอื่น ซึ่งไม่
                    สามารถวินิจฉัยได้จากอาการทางคลินิก`,
      impact2: `2. ไข้เดงกี (Dengue fever; DF) อาจมีอาการ
                    ไม่รุนแรงมีเพียงไข้ร่วมกับปวดศีรษะ เมื่อยตัว
                    หรือมีอาการแบบ classical DF คือ มีไข้สูง
                    กะทันหัน ปวดศีรษะ ปวดกระบอกตา ปวดกล้าม
                    เนื้อปวดกระดูกและมีผื่น อาจมีจุดเลือดออกกที่
                    ผิวหนังสามารถตรวจได้ด้วย tourniquet test
                    ผู้ป่วยส่วนใหญ่มีเม็ดเลือดขาวต่ำ และอาจมี
                    เกล็ดเลือดต่ำได้ ในผู้ใหญ่เมื่อหายแล้วจะมี
                    อาการอ่อนเพลี่ยอยู่นาน โดยทั่วไปไม่สามารถ
                    วินิจฉัยจากอาการทางคลินิกได้แน่นอน ต้อง
                    อาศัยการตรวจทางน้ำเหลืองหรือตรวจหาเชื้อ
                    ไวรัส`,
      impact3: `3. ไข้เลือดออกเดงกี (Dengue
                    heamorrhagic fever; DHF) มีอาการmง
                    คลินิกที่ชัดเจน คือ มีไข้สูงลอยร่วมกับอาการ
                    เลือดออก ตับโต และมีภาวะช็อกในรายที่รุนแรง
                    ในระยะมีไข้มีอาการคล้าย DF และมีลักษณะ
                    เฉพาะของโรคคือเกล็ดเลือดต่ำและมีการรั่วของ
                    พลาสมาซึ่งถ้าพลาสมารั่วออกไปมาก จะเกิด
                    ภาวะช็อกที่เรียกว่า Dengue shock
                    syndrome; DSS ซึ่งการรั่วของพลาสมาเป็น
                    ลักษณะเด่นของ DHF โดยสามารถตรวจพบได้
                    จากระดับความเข้มข้นของเลือด (Hematocrit)
                    สูงขึ้น และมีน้ำในเยื่อหุ้มปอดและช่องท้อง`,
      impact4: `4. ไข้เดงกีที่มีอาการแปลกออกไป (Expanded
                    dengue syndrome; EDS) ที่พบส่วนใหญ่ผู้
                    ป่วยจะมีอาการทางสมอง ตับวาย ไตวาย ผู้ป่วย
                    ที่มีอาการทางสมองส่วนใหญ่เกิดจากภาวะช็อก
                    นานและมีตับวายร่วมด้วย (Hepatic
                    encephalophathy) ส่วนหนึ่งเกิดจากการติด
                    เชื้อ 2 อย่างร่วมกัน หรือมีโรคประจำตัวอยู่เดิม`,
      impact5: `อ้างอิงจาก แนวทางการวินิจฉัยและรักษาโรคไข้เลือดออกแดงกี ฉบับเฉลิมพระเกียรติ 80 พรรษามหาราชินี; สถาบันสุขภาพเด็กแห่งชาติ มหาราชินี กรมการแพทย์ กระทรวงสาธารณะสุข`,
    },
  ];

  const protect = [
    {
      impact1: `1. การป้องกันยุงกัด ได้แก่ การทายากันยุง นานในมุ้ง ใส่เสื้อแขนยาวและกางเกงขายาว`,
      impact2: `2. การจัดการภาชนะหรือสภาพแวดล้อมไม่ให้เป็นแหล่งเพาะพันธุ์ยุงลาย เช่น หมั่นเปลี่ยนน้ำในแจกันทุกสัปดาห์ 
                ใช้ทรายกำจัดลูกน้ำในภาชนะน้ำใช้ ปิดฝาภาชนะน้ำกินหรือน้ำใช้ให้มิดชิด คว่ำภาชนะที่ไม่ใช้เพื่อไม่ให้น้ำขังได้ ปล่อยปลากินลูกน้ำ
                เช่น ปลาหางนกยูงในอ่างบัวหรือไม้น้ำ`,
      impact3: `3. เก็บบ้านให้ปลอดโปร่ง ไม่ให้มีมุมอับ เพื่อป้องกันยุงลายมาเกาะพัก`,
      impact4: `4. ใช้สเปรย์กระป๋องฉีดพ่นกำจัดยุงลายในบ้าน`,
      impact5: `อ้างอิงจาก แนวทางการวินิจฉัยและรักษาโรคไข้เลือดออกแดงกี ฉบับเฉลิมพระเกียรติ 80 พรรษามหาราชินี; สถาบันสุขภาพเด็กแห่งชาติ มหาราชินี กรมการแพทย์ กระทรวงสาธารณะสุข`,
    },
  ];

  const renderTable = (data) => (
    <TableContainer component={Paper} sx={{ mt: 2 }}>
      <Table>
        <TableBody>
          {data.map((row, index) => (
            <TableRow key={index}>
              <TableCell>
                <strong>{row.general}</strong>
                <br></br>
                {row.impact}
                {row.impact1} <br></br>
                {row.impact2} <br></br>
                {row.impact3} <br></br>
                {row.impact4} <br></br>
                <br></br>
                <Typography  sx={{ color: "#666", fontStyle: "italic" }}>
                  {row.impact5}
                </Typography>
                <br></br>
                <strong>{row.risk}</strong>
                <br></br>
                {row.risk_impact}
              </TableCell>
            </TableRow>
          ))}
        </TableBody>
      </Table>
    </TableContainer>
  );

  return (
    <Modal
      aria-labelledby="transition-modal-title"
      aria-describedby="transition-modal-description"
      open={open}
      onClose={handleClose}
      closeAfterTransition
      slots={{ backdrop: Backdrop }}
      slotProps={{ backdrop: { timeout: 500 } }}
    >
      <Fade in={open}>
        <Box sx={style}>
          <Tabs value={tabIndex} onChange={handleTabChange} centered>
            <Tab label="รายละเอียดโรค" />
            <Tab label="อาการของโรค" />
            <Tab label="การป้องกัน" />
          </Tabs>

          {/* <Typography
            className="pm_attr"
            id="transition-modal-title"
            sx={{ mt: 2 }}
          >
            {tabIndex === 0 &&
              `ฝุ่นละอองขนาดไม่เกิน 2.5 ไมครอน (PM25) เป็นฝุ่นที่มีเส้นผ่านศูนย์กลางไม่เกิน 2.5 ไมครอน เกิดจาก
            การเผาไหม้ทั้งจากยานพาหนะการเผาวัสดุการเกษตร ไฟบ้า และกระบวนการอุตสาหกรรม สามารถเข้าไปถึง
            ถุงลมในปอดได้ เป็นผลทำให้เกิดโรคในระบบทางเดินหายใจ และโรคปอดต่างๆ
            หากได้รับในปริมาณมากหรือเป็นเวลานานจะสะสมในเนื้อเยื่อปอดทำให้การทำงานของปอดเสื่อบ
            ประสิทธิภาพลง ทำให้หลอดลมอักเสบ มีอาการหอบหืด
            (อ้างอิงข้อมูลจากกรมควบคุมมลพิษ)`}

            {tabIndex === 1 &&
              `ฝุ่นละอองขนาดไม่เกิน 10 ไมครอน (PM10) เป็นฝุ่นที่มีขนาดศูนย์กลางไม่เกิน 10 ไมครอน 
            เกิดจากการเผาไหม้เชื้อเพลิง การเผาในที่โล่ง กระบวนการอุตสาหกรรม การบด การโม่ 
            หรือการทำให้เป็นผงจากการก่อสร้าง ส่งผลกระทบต่อสุขภาพเนื่องจากเมื่อหายใจเข้าไป
            สามารถเข้าไปสะสมในรระบบทางเดินหายใจ (อ้างอิงกรมควบคุมมลพิษ)`}

            {tabIndex === 2 &&
              `ดัชนีคุณภาพอากาศ (Air Quality Index :
            AQI) เป็นคำที่ใช้แทนค่าความเข้มข้นของสาร
            มลพิษทางอากาศทั้ง 6 ชนิด ได้แก่ ฝุ่นละออง
            ขนาดไม่เกิน 2.5 ไมครอน (PM2.5), ฝุ่นละออง
            ไม่เกิน 10 ไมครอน (PM10), ก๊าช
            คาร์บอนมอนอกไซด์ (CO) ก๊าซโอโซน (03),
            ก๊าซไนโตรเจนไดออกไซด์ (NO2) และก๊าซ
            ซัลเฟอร์ไดออกไซด์ (SO2) (อ้างอิงกรมมลพิษ)`}
          </Typography> */}

          <Typography id="transition-modal-description" sx={{ mt: 2 }}>
            <strong>{tabIndex === 0 && "ระบาดวิทยา"}</strong>
            <strong>{tabIndex === 1 && "กลุ่มอาการทางคลินิก"}</strong>
            <strong>
              {tabIndex === 2 && "การป้องกันไม่ให้ป่วยเป็นโรคไข้เลือดออก"}
            </strong>
          </Typography>

          {tabIndex === 0 && renderTable(detail)}
          {tabIndex === 1 && renderTable(symptom)}
          {tabIndex === 2 && renderTable(protect)}
        </Box>
      </Fade>
    </Modal>
  );
}
