import React, { useState } from "react";
import {
  Modal,
  Backdrop,
  Fade,
  Box,
  Typography,
  Tabs,
  Tab,
  Table,
  TableBody,
  TableCell,
  TableContainer,
  TableHead,
  TableRow,
  Paper,
} from "@mui/material";

const style = {
  position: "absolute",
  top: "50%",
  left: "50%",
  transform: "translate(-50%, -50%)",
  width: "80%",
  maxWidth: 1200,
  bgcolor: "background.paper",
  boxShadow: 24,
  p: 4,
  borderRadius: 2,
};

export default function TransitionsModal({ open, handleClose }) {
  const [tabIndex, setTabIndex] = useState(0);

  const handleTabChange = (event, newValue) => {
    setTabIndex(newValue);
  };

  const SquareColorBox = ({ color, children }) => {
    return (
      <div style={{ display: "flex", alignItems: "center" }}>
        <div
          style={{
            width: 20,
            height: 20,
            backgroundColor: color,
            marginRight: 8,
            borderRadius: 4,
          }}
        ></div>
        <div>{children}</div>{" "}
        {/* this will render the <strong>{row.level}</strong> */}
      </div>
    );
  };

  // Data for tables
  const pm25Data = [
    {
      level: "0-15.0 ดีมาก",
      color: "#33D9FC",
      impact: "ทุกคนสามารถทำกิจกรรมกลางแจ้งได้ตามปกติ",
    },

    {
      level: "15.1 - 25.0 ดี",
      color: "#3AE57F",
      general: "ประชาชนทั่วไป",
      impact: "สามารถทำกิจกรรมกลางแจ้งได้ตามปกติ",
      risk: "กลุ่มเสี่ยง",
      risk_impact: "เลี่ยงการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้ง",
    },

    {
      level: "25.1 - 37.5 ปานกลาง",
      color: "#FCD55B",
      general: "ประชาชนทั่วไป",
      impact: "เลี่ยงการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้ง",
      risk: "กลุ่มเสี่ยง",
      risk_impact:
        "ลดระยะเวลาการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้งควรสวมหน้ากากป้องกันฝุ่นละออง หากมีอาการผิดปกติ เช่น ไอบ่อย แน่นหน้าอก หายใจลำบาก ควรปรึกษาแพทย์",
    },

    {
      level: "37.6 - 75.0 เริ่มมีผลกระทบต่อสุขภาพ",
      color: "#FD9C55",
      general: "ประชาชนทั่วไป",
      impact:
        "ลดระยะเวลาการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้งควรสวมหน้ากากป้องกันฝุ่นละออง หากมีอาการผิดปกติ เช่น ไอบ่อย แน่นหน้าอก หายใจลำบาก ควรปรึกษาแพทย์",
      risk: "กลุ่มเสี่ยง",
      risk_impact: "เลี่ยงการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้ง",
    },

    {
      level: "75.1 ขึ้นไป มีผลกระทบต่อสุขภาพ",
      color: "#EE4C4B",
      general: "ประชาชนทั่วไป",
      impact:
        "ลดระยะเวลาการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้งควรสวมหน้ากากป้องกันฝุ่นละออง หากมีอาการผิดปกติควรปรึกษาแพทย์",
      risk: "ผู้ที่มีโรคประจำตัว",
      risk_impact:
        "งดทำกิจกรรมกลางแจ้ง อยู่ในห้องปลอดฝุ่น เตรียมยาและอุปกรณ์ที่จำเป็นให้พร้อม และปฏิบัติตามึำแนะนำของแพทย์อย่างเคร่งครัด",
    },
  ];

  const pm10Data = [
    {
      level: "0-50 ดีมาก",
      color: "#33D9FC",
      impact: "คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว",
    },

    {
      level: "50-80 ดี",
      color: "#3AE57F",
      impact: "คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว",
    },

    {
      level: "81-120 ปานกลาง",
      color: "#FCD55B",
      general: "ประชาชนทั่วไป",
      impact:
        "ควรเฝ้าระวังสุขภาพ ถ้ามีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หนือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น",
      risk: "ผู้ที่ต้องดูแลสุขภาพเป็นพิเศษ",
      risk_impact:
        "ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น ถ้ามีอาการทางสุขภาพ เช่น ไอ หายใจลำบาก ตาอักเสบ แน่นหน้าอก ปวดศีรษะ หัวใจเต้นผิดปกติ คลื่นไส้ อ่อนเพลีย ควรรีบปรึกษาแพทย์",
    },

    {
      level: "121-180 เริ่มมีผลกระทบต่อสุขภาพ",
      color: "#FD9C55",
      general: "ประชาชนทั่วไป",
      impact:
        "ลดระยะเวลาการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้งควรสวมหน้ากากป้องกันฝุ่นละออง หากมีอาการผิดปกติ เช่น ไอบ่อย แน่นหน้าอก หายใจลำบาก ควรปรึกษาแพทย์",
      risk: "กลุ่มเสี่ยง",
      risk_impact: "เลี่ยงการทำกิจกรรมที่ใช้แรงมากหรือออกกำลังกายกลางแจ้ง",
    },

    {
      level: "181 ขึ้นไป มีผลกระทบต่อสุขภาพ",
      color: "#EE4C4B",
      impact:
        "ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้ง หลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์",
    },
  ];

  const aqiData = [
    {
      level: "0-25 ดีมาก",
      color: "#33D9FC",
      impact: "คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว",
    },

    {
      level: "26-50 ดี",
      color: "#3AE57F",
      impact: "คุณภาพอากาศดีมาก เหมาะสำหรับกิจกรรมกลางแจ้งและการท่องเที่ยว",
    },

    {
      level: "51-100 ปานกลาง",
      color: "#FCD55B",
      general: "ประชาชนทั่วไป",
      impact: "สามารถทำกิจกรรมกลางแจ้งได้ตามปกติ",
      risk: "ผู้ที่ต้องดูแลสุขภาพเป็นพิเศษ",
      risk_impact: `หากมีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง`,
    },

    {
      level: "101-200 เริ่มมีผลกระทบต่อสุขภาพ",
      color: "#FD9C55",
      general: "ประชาชนทั่วไป",
      impact: `ควรเฝ้าระวังสุขภาพ ถ้ามีอาการเบื้องต้น เช่น ไอ หายใจลำบาก ระคายเคืองตา ควรลดระยะเวลาการทำกิจกรรมกลางแจ้ง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น`,
      risk: "ผู้ที่ต้องดูแลสุขภาพเป็นพิเศษ",
      risk_impact: `ควรละนะยะเวลาการทำกิจกรรมกลางแจ้งหรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น ถ้ามีอาการทางสุขภาพ เช่น ไอ หายใจลำบาก ตาอักเสบ แน่นหน้าแก ปวดศีรษะ หัวใจเต้นไม่เป็นปกติ คลื่นไส้ อ่อนเพลีย ควนปรึกษาแพทย์`,
    },

    {
      level: "201 ขึ้นไป มีผลกระทบต่อสุขภาพ",
      color: "#EE4C4B",
      impact:
        "ทุกคนควรหลีกเลี่ยงกิจกรรมกลางแจ้ง หลีกเลี่ยงพื้นที่ที่มีมลพิษทางอากาศสูง หรือใช้อุปกรณ์ป้องกันตนเองหากมีความจำเป็น หากมีอาการทางสุขภาพควรปรึกษาแพทย์",
    },
  ];

  const renderTable = (data) => (
    <TableContainer component={Paper} sx={{ mt: 2 }}>
      <Table>
        <TableHead>
          <TableRow>
            <TableCell>
              <strong>ความหมายของสี</strong>
            </TableCell>
            <TableCell>
              <strong></strong>
            </TableCell>
          </TableRow>
        </TableHead>
        <TableBody>
          {data.map((row, index) => (
            <TableRow key={index}>
              <TableCell>
                <SquareColorBox color={row.color}>
                  <strong>{row.level}</strong>
                </SquareColorBox>
              </TableCell>
              <TableCell>
                <strong>{row.general}</strong>
                <br></br>
                {row.impact}
                <br></br>
                <strong>{row.risk}</strong>
                <br></br>
                {row.risk_impact}
              </TableCell>
            </TableRow>
          ))}
        </TableBody>
      </Table>
    </TableContainer>
  );

  return (
    <Modal
      aria-labelledby="transition-modal-title"
      aria-describedby="transition-modal-description"
      open={open}
      onClose={handleClose}
      closeAfterTransition
      slots={{ backdrop: Backdrop }}
      slotProps={{ backdrop: { timeout: 500 } }}
    >
      <Fade in={open}>
        <Box sx={style}>
          <Tabs value={tabIndex} onChange={handleTabChange} centered>
            <Tab label="PM2.5" />
            <Tab label="PM10" />
            <Tab label="AQI" />
          </Tabs>

          <Typography
            className="pm_attr"
            id="transition-modal-title"
            sx={{ mt: 2 }}
          >
            {tabIndex === 0 &&
              `ฝุ่นละอองขนาดไม่เกิน 2.5 ไมครอน (PM25) เป็นฝุ่นที่มีเส้นผ่านศูนย์กลางไม่เกิน 2.5 ไมครอน เกิดจาก
            การเผาไหม้ทั้งจากยานพาหนะการเผาวัสดุการเกษตร ไฟบ้า และกระบวนการอุตสาหกรรม สามารถเข้าไปถึง
            ถุงลมในปอดได้ เป็นผลทำให้เกิดโรคในระบบทางเดินหายใจ และโรคปอดต่างๆ
            หากได้รับในปริมาณมากหรือเป็นเวลานานจะสะสมในเนื้อเยื่อปอดทำให้การทำงานของปอดเสื่อบ
            ประสิทธิภาพลง ทำให้หลอดลมอักเสบ มีอาการหอบหืด
            (อ้างอิงข้อมูลจากกรมควบคุมมลพิษ)`}

            {tabIndex === 1 &&
              `ฝุ่นละอองขนาดไม่เกิน 10 ไมครอน (PM10) เป็นฝุ่นที่มีขนาดศูนย์กลางไม่เกิน 10 ไมครอน 
            เกิดจากการเผาไหม้เชื้อเพลิง การเผาในที่โล่ง กระบวนการอุตสาหกรรม การบด การโม่ 
            หรือการทำให้เป็นผงจากการก่อสร้าง ส่งผลกระทบต่อสุขภาพเนื่องจากเมื่อหายใจเข้าไป
            สามารถเข้าไปสะสมในรระบบทางเดินหายใจ (อ้างอิงกรมควบคุมมลพิษ)`}

            {tabIndex === 2 &&
              `ดัชนีคุณภาพอากาศ (Air Quality Index :
            AQI) เป็นคำที่ใช้แทนค่าความเข้มข้นของสาร
            มลพิษทางอากาศทั้ง 6 ชนิด ได้แก่ ฝุ่นละออง
            ขนาดไม่เกิน 2.5 ไมครอน (PM2.5), ฝุ่นละออง
            ไม่เกิน 10 ไมครอน (PM10), ก๊าช
            คาร์บอนมอนอกไซด์ (CO) ก๊าซโอโซน (03),
            ก๊าซไนโตรเจนไดออกไซด์ (NO2) และก๊าซ
            ซัลเฟอร์ไดออกไซด์ (SO2) (อ้างอิงกรมมลพิษ)`}
          </Typography>

          {/* <Typography id="transition-modal-description" sx={{ mt: 2 }}>
            {tabIndex === 0 && 'PM2.5 เป็นฝุ่นขนาดเล็กที่สามารถเข้าสู่ปอดและกระแสเลือดได้'}
            {tabIndex === 1 && 'PM10 คือฝุ่นละอองที่มีขนาดใหญ่กว่า PM2.5 และอาจมีผลกระทบต่อสุขภาพ'}
            {tabIndex === 2 && 'AQI เป็นดัชนีที่ใช้วัดคุณภาพอากาศและมีค่าตั้งแต่ 0-500'}
          </Typography> */}
          
          {tabIndex === 0 && renderTable(pm25Data)}
          {tabIndex === 1 && renderTable(pm10Data)}
          {tabIndex === 2 && renderTable(aqiData)}
        </Box>
      </Fade>
    </Modal>
  );
}
